buoyantCavityTest/0/wallHeatFlux
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallHeatFlux;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    topAndBottom
    {
        type            calculated;
        value           uniform 0;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
354.391
354.391
354.391
354.391
354.391
354.391
354.391
354.391
...
)
;
    }
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
-116.528
-116.528
-116.528
-116.528
-116.528
-116.528
-116.528
-116.528
...
)
;
    }
}


// ************************************************************************* //
